Tekla.Structures.ModelInternal.dotPart_t
Serialization structure for Part.

Tekla.Structures.ModelInternal.dotPart_t.ModelObject
Base class.

Tekla.Structures.ModelInternal.dotPart_t.Position
The way the part is positioned in the model.

Tekla.Structures.ModelInternal.dotPart_t.Profile
The profile of the part.

Tekla.Structures.ModelInternal.dotPart_t.Material
The material this part is made of.

Tekla.Structures.ModelInternal.dotPart_t.PartNumber
Defines the numbering in part sense.

Tekla.Structures.ModelInternal.dotPart_t.AssemblyNumber
Defines the numbering in assembly sense.

Tekla.Structures.ModelInternal.dotPart_t.DeformingData
Defines the deforming of the part.

Tekla.Structures.ModelInternal.dotPart_t.aName
The name of the part.

Tekla.Structures.ModelInternal.dotPart_t.aClass
The class of the part.

Tekla.Structures.ModelInternal.dotPart_t.aFinish
The finish of the part.

Tekla.Structures.ModelInternal.dotPart_t.CastUnitType
The cast unit type of the part.

Tekla.Structures.ModelInternal.dotPart_t.PourPhase
The pour phase of the part.

Tekla.Structures.ModelInternal.dotPart_t.StartPointOffset
Defines the part start point offset.

Tekla.Structures.ModelInternal.dotPart_t.EndPointOffset
Defines the part end point offset.

Tekla.Structures.ModelInternal.dotPart_t.Radius
Radius for curved beam. Used only internally! May be removed later when conversion from curved to polybeam exists.

Tekla.Structures.ModelInternal.dotPart_t.SubType
Subtype for part. Will be used for opening right object dialog.

Tekla.Structures.ModelInternal.dotPart_t.StartLevelName
The start level name.

Tekla.Structures.ModelInternal.dotPart_t.EndLevelName
The end level name.

Tekla.Structures.ModelInternal.dotPart_t.StartLevelOffset
The start level offset.

Tekla.Structures.ModelInternal.dotPart_t.EndLevelOffset
The end level offset.

Tekla.Structures.ModelInternal.dotPart_t.ClientId
Defines part client id.